{
  "header": {
    "title": "صيغة مالية",
    "openMenu": "فتح القائمة الرئيسية",
    "nav": {
      "home": "الرئيسية",
      "articles": "مقالات",
      "about": "من نحن",
      "contact": "اتصل بنا"
    }
  },
  "footer": {
    "copyright": "صيغة مالية. جميع الحقوق محفوظة.",
    "privacy": "سياسة الخصوصية",
    "terms": "شروط الاستخدام"
  },
  "converter": {
    "enterNumber": "أدخل الرقم",
    "placeholder": "مثال: 1250.75",
    "selectCurrency": "اختر العملة",
    "result": "النتيجة",
    "outputPlaceholder": "سيظهر النص المالي هنا...",
    "copy": "نسخ النص",
    "copySuccess": "تم النسخ بنجاح!",
    "copyFail": "فشل النسخ."
  },
  "dateConverter": {
    "title": "محول التاريخ",
    "selectDate": "اختر التاريخ",
    "result": "التاريخ نصاً",
    "placeholder": "يوم/شهر/سنة",
    "outputPlaceholder": "النتيجة ستظهر هنا..."
  },
  "home": {
    "mainTitle": "محول الأرقام إلى نصوص مالية",
    "subtitle": "أداة دقيقة وموثوقة لتحويل المبالغ الرقمية إلى صيغة نصية عربية صحيحة، مثالية للشيكات والعقود والمستندات الرسمية.",
    "whyUse": {
      "title": "لماذا تستخدم صيغة مالية؟",
      "p1": "في عالم المعاملات المالية والقانونية، الدقة هي كل شيء. خطأ صغير في كتابة رقم يمكن أن يؤدي إلى تعقيدات كبيرة. تم تصميم أداة 'صيغة مالية' لتكون مساعدك الرقمي الذي يضمن لك كتابة المبالغ المالية بالحروف العربية بشكل صحيح 100%، مما يمنحك الثقة والأمان في جميع مستنداتك.",
      "p2": "الأداة تعمل بالكامل على جهازك، مما يعني أن بياناتك لا تغادر متصفحك أبداً. نحن نلتزم بأعلى معايير الخصوصية، فلا يتم جمع أو تخزين أي أرقام تقوم بإدخالها. هذا يجعلها الخيار الأمثل للمحاسبين والمحامين ومديري العقود وأي شخص يتعامل مع مستندات مالية حساسة.",
      "beneficiariesTitle": "من هم المستفيدون من الأداة؟",
      "b1_strong": "المحاسبون والمديرون الماليون:",
      "b1_text": "لضمان دقة الشيكات والفواتير والتقارير المالية.",
      "b2_strong": "المحامون ومستشارو العقود:",
      "b2_text": "لكتابة المبالغ في العقود والاتفاقيات بشكل لا يقبل الشك.",
      "b3_strong": "رواد الأعمال وأصحاب الشركات:",
      "b3_text": "لتحرير المستندات التجارية والصفقات بثقة واحترافية.",
      "b4_strong": "الأفراد:",
      "b4_text": "عند كتابة شيكات شخصية أو توقيع عقود إيجار أو بيع.",
      "p3": "مع دعمها لمختلف العملات الرئيسية في المنطقة العربية، توفر 'صيغة مالية' حلاً شاملاً وموثوقاً يتجاوز مجرد التحويل، ليصبح جزءاً لا يتجزأ من روتين عملك المالي اليومي."
    }
  },
  "about": {
    "title": "من نحن",
    "p1": "مرحبًا بك في 'صيغة مالية'. نحن فريق من المطورين والخبراء الماليين الذين لاحظوا الحاجة إلى أداة بسيطة وموثوقة لتحويل الأرقام إلى نصوص باللغة العربية للأغراض المالية والقانونية.",
    "p2": "هدفنا هو توفير أداة مجانية، سهلة الاستخدام، وآمنة تمامًا، تساعد المحترفين والأفراد على حد سواء على تجنب الأخطاء الشائعة في كتابة المبالغ، والتي يمكن أن تكون لها عواقب وخيمة.",
    "p3": "نحن نؤمن بأن الدقة والوضوح هما أساس أي معاملة ناجحة. لذلك، قمنا بتطوير خوارزمية التحويل الخاصة بنا بعناية فائقة لضمان مطابقتها للمعايير اللغوية والمحاسبية المعتمدة في المستندات الرسمية.",
    "p4": "أهم ما يميزنا هو التزامنا بالخصوصية. 'صيغة مالية' هي أداة تعمل بالكامل على جانب العميل، مما يعني أن أي بيانات تدخلها لا يتم إرسالها أو تخزينها على أي خوادم. أمانك المالي وخصوصيتك هما أولويتنا القصوى.",
    "p5": "نأمل أن تجد هذه الأداة مفيدة في عملك وحياتك اليومية."
  },
  "contact": {
    "title": "اتصل بنا",
    "p1": "نحن نسعد دائمًا بسماع آرائكم واقتراحاتكم. إذا كان لديك أي سؤال، أو واجهت أي مشكلة أثناء استخدام الأداة، أو لديك فكرة لتطويرها، فلا تتردد في التواصل معنا.",
    "p2": "يمكنك مراسلتنا مباشرة عبر البريد الإلكتروني التالي:",
    "p3": "نسعى للرد على جميع الاستفسارات في أقرب وقت ممكن. شكرًا لاهتمامك بـ 'صيغة مالية'."
  },
  "privacy": {
    "title": "سياسة الخصوصية",
    "effectiveDate": "تاريخ التحديث: 3 يناير 2026",
    "intro": "في صيغة مالية، نولي اهتماماً كبيراً لخصوصية زوارنا. توضح هذه الوثيقة أنواع المعلومات التي قد نجمعها وكيفية استخدامها.",
    "section1": {
      "title": "1. البيانات التي نجمعها",
      "content": "نحن لا نطلب منك تسجيل الدخول أو تقديم أي معلومات شخصية (مثل الاسم، البريد الإلكتروني، رقم الهاتف) لاستخدام أدواتنا. جميع عمليات الحساب والتحويل تتم بشكل فوري على متصفحك ولا نقوم بتخزين مدخلاتك على خوادمنا."
    },
    "section2": {
      "title": "2. ملفات تعريف الارتباط (Cookies)",
      "content": "يستخدم موقعنا ملفات تعريف الارتباط لتحسين تجربة المستخدم، وتحليل حركة المرور، وتخصيص المحتوى. كما نستخدم ملفات تعريف ارتباط من جهات خارجية (مثل Google AdSense) لعرض إعلانات مناسبة لاهتماماتك."
    },
    "section3": {
      "title": "3. إعلانات Google AdSense",
      "content": "نستعين بشركات إعلان كطرف ثالث لعرض الإعلانات. يحق لهذه الشركات استخدام معلومات حول زياراتك لهذا الموقع (باستثناء الاسم أو العنوان أو البريد الإلكتروني أو رقم الهاتف) لتقديم إعلانات حول البضائع والخدمات التي تهمك عن طريق ملفات تعريف الارتباط DART."
    },
    "section4": {
      "title": "4. حقوق المستخدم",
      "content": "لديك الحق في تعطيل ملفات تعريف الارتباط من خلال إعدادات المتصفح الخاص بك. يرجى ملاحظة أن هذا قد يؤثر على عمل بعض ميزات الموقع."
    },
    "contact": "إذا كان لديك أي استفسار حول سياسة الخصوصية، يرجى التواصل معنا عبر صفحة 'اتصل بنا'."
  },
  "terms": {
    "title": "شروط الاستخدام",
    "intro": "أهلاً بك في موقع صيغة مالية. يرجى قراءة الشروط التالية بعناية قبل استخدام الموقع.",
    "section1": {
      "title": "1. الموافقة على الشروط",
      "content": "بمجرد استخدامك لهذا الموقع، فإنك توافق على الالتزام بهذه الشروط وجميع القوانين واللوائح المعمول بها."
    },
    "section2": {
      "title": "2. استخدام الأدوات",
      "content": "جميع الأدوات المتاحة (محولات، حاسبات، مولدات) مخصصة للاستخدام العام. رغم حرصنا على الدقة، فإننا لا نضمن خلو النتائج من الأخطاء تماماً، ويتحمل المستخدم مسؤولية التحقق من صحة المخرجات قبل اعتمادها في معاملات رسمية."
    },
    "section3": {
      "title": "3. حقوق الملكية الفكرية",
      "content": "جميع المحتويات والمواد المنشورة على هذا الموقع (نصوص، أكواد، تصاميم) محمية بموجب حقوق النشر. يُمنع نسخ أو إعادة نشر المحتوى دون إذن كتابي مسبق."
    },
    "section4": {
      "title": "4. إخلاء المسؤولية",
      "content": "لا يتحمل موقع صيغة مالية أو القائمون عليه أي مسؤولية قانونية عن أي خسائر أو أضرار مباشرة أو غير مباشرة قد تنجم عن استخدام أدواتنا أو الاعتماد على المعلومات الواردة في الموقع."
    },
    "section5": {
      "title": "5. التعديلات",
      "content": "نحتفظ بالحق في تعديل شروط الاستخدام في أي وقت دون إشعار مسبق. يُعتبر استمرارك في استخدام الموقع بعد التعديلات موافقة ضمنية عليها."
    }
  },
  "numberConverterPage": {
    "mainTitle": "محول الأرقام إلى نصوص",
    "subtitle": "حول أي رقم إلى كتابة نصية (تفقيط) باللغة العربية أو الإنجليزية بدقة 100% مع دعم لجميع العملات والفواصل العشرية."
  },
  "dateConverterPage": {
    "mainTitle": "محول التاريخ الهجري والميلادي",
    "subtitle": "أداة دقيقة للتحويل بين التقويم الهجري والميلادي، مع عرض اسم اليوم والشهر.",
    "content": "<p>يعد التاريخ جزءاً أساسياً من حياتنا اليومية، وسواء كنت بحاجة إلى معرفة تاريخ ميلادك بالهجري، أو تخطط لمناسبة دينية، أو تحتاج إلى تحويل تاريخ عقد رسمي، فإن <strong>محول التاريخ</strong> لدينا يوفر لك الدقة التي تحتاجها. تعتمد أداتنا على تقويم أم القرى المعتمد في المملكة العربية السعودية، مما يضمن لك نتائج موثوقة تماماً.</p><h3 class='text-xl font-bold mt-4'>الميزات الرئيسية:</h3><ul class='list-disc ps-5 mt-2'><li>تحويل فوري بين الهجري والميلادي.</li><li>عرض اسم اليوم والشهر.</li><li>حساب دقيق للكبيسة.</li></ul>"
  },
  "invoiceGeneratorPage": {
    "mainTitle": "مولد الفواتير الاحترافي",
    "subtitle": "صمم فواتير تجارية وضريبية متوافقة مع المتطلبات القانونية في ثوانٍ. ميزة التفقيط الآلي للمبالغ مدمجة."
  },
  "receiptGeneratorPage": {
    "mainTitle": "مولد سندات القبض",
    "subtitle": "أنشئ إيصالات استلام نقدية أو شيكات بوثائق رسمية تحفظ حقوقك. جاهزة للطباعة أو الحفظ كملف PDF."
  },
  "contractClausePage": {
    "mainTitle": "مساعد صياغة العقود",
    "subtitle": "احصل على صياغة قانونية مُحكمة للبنود المالية في عقودك، تضمن الوضوح وتحميك من الثغرات."
  },
  "loanCalculatorPage": {
    "mainTitle": "حاسبة التمويل والأقساط",
    "subtitle": "خطط لقرضك القادم بذكاء. احسب القسط الشهري، إجمالي الفوائد، واطلع على جدول السداد التفصيلي."
  },
  "currencyConverterPage": {
    "mainTitle": "أسعار العملات المباشرة",
    "subtitle": "تابع أسعار الصرف العالمية لحظة بلحظة وحول بين العملات بدقة. يعتمد على بيانات سوق حية."
  },
  "glossaryPage": {
    "mainTitle": "المصطلحات المالية",
    "subtitle": "قاموس شامل لأهم المصطلحات المالية والمحاسبية والاقتصادية."
  },
  "articlesPage": {
    "mainTitle": "المقالات",
    "subtitle": "نصائح ومعلومات مالية تهمك"
  },
  "articles": {
    "title": "مقالات متخصصة",
    "subtitle": "مقالات لزيادة معرفتك بأهمية الدقة في المستندات المالية والقانونية.",
    "readMore": "اقرأ المزيد"
  },
  "articleDetail": {
    "backLink": "العودة إلى قائمة المقالات",
    "notFound": {
      "title": "المقالة غير موجودة",
      "message": "عذراً، لم نتمكن من العثور على المقالة التي تبحث عنها."
    }
  },
  "meta": {
    "home": {
      "title": "صيغة مالية | محول الأرقام إلى نصوص مالية",
      "description": "أداة دقيقة لتحويل المبالغ المالية من أرقام إلى نصوص باللغة العربية والإنجليزية، مثالية للعقود والفواتير والشيكات."
    },
    "articles": {
      "title": "مقالات | صيغة مالية",
      "description": "مقالات متخصصة حول كتابة المبالغ المالية، الأخطاء الشائعة، والمتطلبات القانونية لضمان دقة مستنداتك."
    },
    "articleDetail": {
      "title": "%s | صيغة مالية",
      "description": "%s"
    },
    "about": {
      "title": "عن الموقع | صيغة مالية",
      "description": "تعرف على هدف ورؤية 'صيغة مالية'، الأداة الموثوقة لتحويل الأرقام إلى نصوص مالية بدقة وأمان."
    },
    "contact": {
      "title": "اتصل بنا | صيغة مالية",
      "description": "تواصل مع فريق 'صيغة مالية'. نرحب بملاحظاتك، استفساراتك، واقتراحاتك لتحسين خدماتنا."
    },
    "privacy": {
      "title": "سياسة الخصوصية | صيغة مالية",
      "description": "اقرأ سياسة الخصوصية الخاصة بنا لفهم كيف نلتزم بحماية بياناتك. أداتنا لا تجمع أو تخزن أي معلومات شخصية."
    },
    "terms": {
      "title": "شروط الخدمة | صيغة مالية",
      "description": "اطلع على شروط وأحكام استخدام أداة 'صيغة مالية'. استخدامك للموقع يعني موافقتك على هذه الشروط."
    },
    "numberConverter": {
      "title": "محول الأرقام | صيغة مالية",
      "description": "حول الأرقام إلى نصوص عربية وإنجليزية بدقة تامة. أداة مثالية للفواتير والشيكات والعقود."
    },
    "dateConverter": {
      "title": "محول التاريخ | صيغة مالية",
      "description": "حول بين التاريخ الهجري والميلادي بدقة وسهولة. عرض التاريخ بصيغ مختلفة."
    },
    "invoiceGenerator": {
      "title": "مولد الفواتير | صيغة مالية",
      "description": "أنشئ فواتير احترافية جاهزة للطباعة مع تحويل تلقائي للمبالغ إلى نصوص."
    },
    "receiptGenerator": {
      "title": "سند قبض | صيغة مالية",
      "description": "أنشئ سندات قبض رسمية واحترافية في ثوانٍ. تحويل تلقائي للأرقام."
    },
    "contractClause": {
      "title": "صياغة البنود | صيغة مالية",
      "description": "أداة مساعدة لصياغة البنود المالية في العقود بدقة قانونية لمنع النزاعات."
    },
    "loanCalculator": {
      "title": "حاسبة القروض | صيغة مالية",
      "description": "احسب القسط الشهري والفوائد وجدول السداد لقرضك بدقة."
    },
    "currencyConverter": {
      "title": "محول العملات | صيغة مالية",
      "description": "أسعار صرف العملات الحية والدقيقة. تحويل بين جميع العملات العالمية."
    }
  }
}