{
  "header": {
    "title": "صيغة مالية",
    "openMenu": "فتح القائمة الرئيسية",
    "nav": {
      "home": "الرئيسية",
      "articles": "مقالات",
      "about": "من نحن",
      "contact": "اتصل بنا"
    }
  },
  "footer": {
    "copyright": "صيغة مالية. جميع الحقوق محفوظة.",
    "privacy": "سياسة الخصوصية",
    "terms": "شروط الاستخدام"
  },
  "converter": {
    "enterNumber": "أدخل الرقم",
    "placeholder": "مثال: 1250.75",
    "selectCurrency": "اختر العملة",
    "result": "النتيجة",
    "outputPlaceholder": "سيظهر النص المالي هنا...",
    "copy": "نسخ النص",
    "copySuccess": "تم النسخ بنجاح!",
    "copyFail": "فشل النسخ."
  },
  "home": {
    "mainTitle": "محول الأرقام إلى نصوص مالية",
    "subtitle": "أداة دقيقة وموثوقة لتحويل المبالغ الرقمية إلى صيغة نصية عربية صحيحة، مثالية للشيكات والعقود والمستندات الرسمية.",
    "whyUse": {
      "title": "لماذا تستخدم صيغة مالية؟",
      "p1": "في عالم المعاملات المالية والقانونية، الدقة هي كل شيء. خطأ صغير في كتابة رقم يمكن أن يؤدي إلى تعقيدات كبيرة. تم تصميم أداة 'صيغة مالية' لتكون مساعدك الرقمي الذي يضمن لك كتابة المبالغ المالية بالحروف العربية بشكل صحيح 100%، مما يمنحك الثقة والأمان في جميع مستنداتك.",
      "p2": "الأداة تعمل بالكامل على جهازك، مما يعني أن بياناتك لا تغادر متصفحك أبداً. نحن نلتزم بأعلى معايير الخصوصية، فلا يتم جمع أو تخزين أي أرقام تقوم بإدخالها. هذا يجعلها الخيار الأمثل للمحاسبين والمحامين ومديري العقود وأي شخص يتعامل مع مستندات مالية حساسة.",
      "beneficiariesTitle": "من هم المستفيدون من الأداة؟",
      "b1_strong": "المحاسبون والمديرون الماليون:",
      "b1_text": "لضمان دقة الشيكات والفواتير والتقارير المالية.",
      "b2_strong": "المحامون ومستشارو العقود:",
      "b2_text": "لكتابة المبالغ في العقود والاتفاقيات بشكل لا يقبل الشك.",
      "b3_strong": "رواد الأعمال وأصحاب الشركات:",
      "b3_text": "لتحرير المستندات التجارية والصفقات بثقة واحترافية.",
      "b4_strong": "الأفراد:",
      "b4_text": "عند كتابة شيكات شخصية أو توقيع عقود إيجار أو بيع.",
      "p3": "مع دعمها لمختلف العملات الرئيسية في المنطقة العربية، توفر 'صيغة مالية' حلاً شاملاً وموثوقاً يتجاوز مجرد التحويل، ليصبح جزءاً لا يتجزأ من روتين عملك المالي اليومي."
    }
  },
  "about": {
    "title": "من نحن",
    "p1": "مرحبًا بك في 'صيغة مالية'. نحن فريق من المطورين والخبراء الماليين الذين لاحظوا الحاجة إلى أداة بسيطة وموثوقة لتحويل الأرقام إلى نصوص باللغة العربية للأغراض المالية والقانونية.",
    "p2": "هدفنا هو توفير أداة مجانية، سهلة الاستخدام، وآمنة تمامًا، تساعد المحترفين والأفراد على حد سواء على تجنب الأخطاء الشائعة في كتابة المبالغ، والتي يمكن أن تكون لها عواقب وخيمة.",
    "p3": "نحن نؤمن بأن الدقة والوضوح هما أساس أي معاملة ناجحة. لذلك، قمنا بتطوير خوارزمية التحويل الخاصة بنا بعناية فائقة لضمان مطابقتها للمعايير اللغوية والمحاسبية المعتمدة في المستندات الرسمية.",
    "p4": "أهم ما يميزنا هو التزامنا بالخصوصية. 'صيغة مالية' هي أداة تعمل بالكامل على جانب العميل، مما يعني أن أي بيانات تدخلها لا يتم إرسالها أو تخزينها على أي خوادم. أمانك المالي وخصوصيتك هما أولويتنا القصوى.",
    "p5": "نأمل أن تجد هذه الأداة مفيدة في عملك وحياتك اليومية."
  },
  "contact": {
    "title": "اتصل بنا",
    "p1": "نحن نسعد دائمًا بسماع آرائكم واقتراحاتكم. إذا كان لديك أي سؤال، أو واجهت أي مشكلة أثناء استخدام الأداة، أو لديك فكرة لتطويرها، فلا تتردد في التواصل معنا.",
    "p2": "يمكنك مراسلتنا مباشرة عبر البريد الإلكتروني التالي:",
    "p3": "نسعى للرد على جميع الاستفسارات في أقرب وقت ممكن. شكرًا لاهتمامك بـ 'صيغة مالية'."
  },
  "privacy": {
    "title": "سياسة الخصوصية",
    "effectiveDate": "تاريخ السريان: 1 يناير 2024",
    "intro": "في 'صيغة مالية'، خصوصيتك هي أولويتنا القصوى. نحن ملتزمون بحماية بياناتك وتوفير تجربة آمنة تمامًا. توضح سياسة الخصوصية هذه كيف أننا لا نجمع أو نستخدم أي معلومات شخصية منك.",
    "section1": {
      "title": "1. عدم جمع البيانات",
      "content": "نحن نؤكد بشكل قاطع أن أداة 'صيغة مالية' لا تجمع أو تخزن أو تشارك أي بيانات شخصية أو مالية تقوم بإدخالها. جميع عمليات تحويل الأرقام إلى نصوص تتم بالكامل داخل متصفح الويب الخاص بك على جهازك المحلي (Client-Side). لا يتم إرسال أي من معلوماتك إلى خوادمنا أو إلى أي طرف ثالث."
    },
    "section2": {
      "title": "2. ملفات تعريف الارتباط (Cookies)",
      "content": "قد نستخدم ملفات تعريف الارتباط الأساسية لتحسين تجربة المستخدم على الموقع، مثل تذكر تفضيلاتك. هذه الملفات لا تحتوي على أي معلومات تعريف شخصية."
    },
    "section3": {
      "title": "3. خدمات الطرف الثالث",
      "content": "قد يعرض موقعنا إعلانات من شبكات إعلانية تابعة لجهات خارجية مثل Google AdSense. قد تستخدم هذه الشركات معلومات (لا تتضمن اسمك أو عنوانك أو عنوان بريدك الإلكتروني أو رقم هاتفك) حول زياراتك لهذا الموقع ومواقع الويب الأخرى من أجل توفير إعلانات حول السلع والخدمات التي تهمك."
    },
    "section4": {
      "title": "4. تغييرات على سياسة الخصوصية",
      "content": "قد نقوم بتحديث سياسة الخصوصية هذه من وقت لآخر. سنقوم بإعلامك بأي تغييرات عن طريق نشر سياسة الخصوصية الجديدة على هذه الصفحة."
    },
    "contact": "إذا كان لديك أي أسئلة حول سياسة الخصوصية هذه، يرجى الاتصال بنا."
  },
  "terms": {
    "title": "شروط الاستخدام",
    "intro": "مرحبًا بك في 'صيغة مالية'. باستخدامك لموقعنا، فإنك توافق على الالتزام بشروط وأحكام الاستخدام التالية. يرجى قراءتها بعناية.",
    "section1": {
      "title": "1. استخدام الأداة",
      "content": "يتم توفير أداة تحويل الأرقام إلى نصوص 'كما هي' للاستخدام الشخصي والتجاري. يجب عليك استخدام الأداة بطريقة مسؤولة ووفقًا لجميع القوانين واللوائح المعمول بها."
    },
    "section2": {
      "title": "2. دقة المعلومات",
      "content": "لقد بذلنا قصارى جهدنا لضمان دقة الخوارزمية المستخدمة في التحويل. ومع ذلك، لا نضمن أن تكون النتائج خالية من الأخطاء بنسبة 100%. تقع على عاتق المستخدم مسؤولية التحقق من صحة النص الناتج قبل استخدامه في أي مستندات رسمية أو قانونية أو مالية."
    },
    "section3": {
      "title": "3. إخلاء المسؤولية",
      "content": "موقع 'صيغة مالية' وفريق عمله غير مسؤولين عن أي أضرار مباشرة أو غير مباشرة، أو خسائر مالية، أو مشاكل قانونية قد تنشأ عن استخدام (أو عدم القدرة على استخدام) هذه الأداة. استخدامك للأداة هو على مسؤوليتك الخاصة بالكامل."
    },
    "section4": {
      "title": "4. الملكية الفكرية",
      "content": "جميع المحتويات على هذا الموقع، بما في ذلك النصوص والرسومات والشعار والأداة نفسها، هي ملك لـ 'صيغة مالية' ومحمية بموجب قوانين حقوق النشر."
    },
    "section5": {
      "title": "5. تعديل الشروط",
      "content": "نحتفظ بالحق في تعديل هذه الشروط في أي وقت. استمرارك في استخدام الموقع بعد أي تعديلات يعني موافقتك على الشروط الجديدة."
    }
  },
  "articles": {
    "title": "مقالات متخصصة",
    "subtitle": "مقالات لزيادة معرفتك بأهمية الدقة في المستندات المالية والقانونية.",
    "readMore": "اقرأ المزيد"
  },
  "articleDetail": {
    "backLink": "العودة إلى قائمة المقالات",
    "notFound": {
      "title": "المقالة غير موجودة",
      "message": "عذراً، لم نتمكن من العثور على المقالة التي تبحث عنها."
    }
  }
}
